source setup.tcl

# Create a new library.
create_mw_lib  -technology /usr/cadtool/cad/synopsys/SAED32_EDK/tech/milkyway/saed32nm_1p9m_mw.tf -mw_reference_library {/usr/cadtool/cad/synopsys/SAED32_EDK/lib/stdcell_hvt/milkyway/saed32nm_hvt_1p9m} -bus_naming_style {[%d]}  -open  CHIP

# Import your design.
# Frist, Wrap the synthesized netlist in icc/pre_layout/design_data
# sh get_pnr_netlist.bat
# cat ../dc/lenet_syn.v CHIP_syn_app.v > CHIP_syn.v
import_designs -format verilog -top CHIP -cel CHIP {../pre_layout/design_data/CHIP_syn.v}

# Take a look at CHIP_syn.sdc to find the difference from the xxx_syn.sdc which is generated by DC.
# The clock period is relaxed to 1.1*TEST_CYCLE(in DC).
# Besides the max library for setup checking, the min library for hold checking is also identified
read_sdc  -version Latest "../pre_layout/design_data/CHIP_syn.sdc"

# TLU+ model setup.
set_tlu_plus_files -max_tluplus /usr/cadtool/cad/synopsys/SAED32_EDK/tech/star_rcxt/saed32nm_1p9m_Cmax.tluplus -min_tluplus /usr/cadtool/cad/synopsys/SAED32_EDK/tech/star_rcxt/saed32nm_1p9m_Cmin.tluplus -tech2itf_map  /usr/cadtool/cad/synopsys/SAED32_EDK/tech/star_rcxt/saed32nm_tf_itf_tluplus.map

# Power/Ground connection.
derive_pg_connection -power_net {VDD} -ground_net {VSS} -power_pin {VDD} -ground_pin {VSS} -create_ports top

# Save your design.
save_mw_cel CHIP
save_mw_cel -as 0_design_setup